{
    "dynamicFiles": {
        "sirepoLibs": {
            "js": [
                "genesis.js"
            ]
        }
    },
    "enum": {
        "OutputParameter": [
            ["bunching", "bunching"],
            ["energy", "energy"],
            ["error", "error"],
            ["increment", "increment"],
            ["p_mid", "p_mid"],
            ["phi_mid", "phi_mid"],
            ["power", "power"],
            ["r_size", "r_size"],
            ["xrms", "xrms"],
            ["yrms", "yrms"]
        ],
        "ParticleColumn": [
            ["gamma", "gamma"],
            ["psi", "psi"],
            ["x", "x"],
            ["y", "y"],
            ["pxmc", "p_x/mc"],
            ["pymc", "p_y/mc"]
        ],
        "TaperModel": [
            ["0", "No Taper"],
            ["1", "Linear Taper"],
            ["2", "Quadratic Taper"]
        ],
        "Iscan": [
            ["0",  "GAMMA0"],
            ["1", "DELGAM"],
            ["2", "CURPEAK"],
            ["3", "XLAMDS"],
            ["4", "AW0"],
            ["5", "ISEED"],
            ["6", "PXBEAM"],
            ["7", "PYBEAM"],
            ["8", "XBEAM"],
            ["9", "YBEAM"],
            ["10", "RXBEAM"],
            ["11", "RYBEAM"],
            ["12", "XLAMD"],
            ["13", "DELAW"],
            ["14", "ALPHAX"],
            ["15", "ALPHAY"],
            ["16", "EMITX"],
            ["17", "EMITY"],
            ["18", "PRAD0"],
            ["19", "ZRAYL"],
            ["20", "ZWAIST"],
            ["21", "AWD"],
            ["22", "BEAMFILE"],
            ["23", "BEAMOPT"],
            ["24", "BEAMGAM"]
        ],
        "Iertyp": [
            ["0", "Uniform"],
            ["1", "Gaussian"],
            ["2", "Correlated errors to minimize field integrals"],
            ["3", "Disable field errors"]
        ],
        "Iwityp": [
           ["0", "Planar"],
           ["1", "Helical"]
        ],
        "Lbc": [
            ["0", "Direchlet"],
            ["1", "Neumann"]
        ],
        "IgamGaus": [
            ["1", "Gaussian"],
            ["2", "Uniform"]
        ],
        "ItGaus": [
            ["1", "Gaussian"],
            ["2", "Uniform"],
            ["3", "Parabolic"]
        ]
    },
    "frameIdFields": {
        "fieldDistributionAnimation": [],
        "parameterAnimation": ["y"],
        "particleAnimation": ["x", "y"]
    },
    "localRoutes": {
        "source": {
            "config": {
                "controller": "SourceController as source",
                "templateUrl": "/static/html/genesis-source.html"
            }
        },
        "visualization": {
            "route": "/visualization/:simulationId",
            "config": {
                "controller": "VisualizationController as visualization",
                "templateUrl": "/static/html/genesis-visualization.html"
            }
        }
    },
    "model": {
        "electronBeam": {
            "alphax": [
                "Rotation of the transverse phase space distribution in x",
                "Float",
                0.0,
                "ALPHAX: Rotation of the transverse phase space distribution in x according to the standard definition ALPHAX = - < xx' >  GAMMA0 / EMITX."
            ],
            "alphay": [
                "Rotation of the transverse phase space distribution in y",
                "Float",
                0.0,
                "ALPHAY: Rotation of the transverse phase space distribution in y. See ALPHAX for more information."
            ],
            "bunch": [
                "Initial value of the bunching factor",
                "Float",
                0.0,
                "BUNCH: Initial value of the bunching factor, when quite loading is used."
            ],
            "bunchphase": [
                "Phase of initial bunching [rad]",
                "Float",
                0.0,
                "BUNCHPHASE: Phase of initial bunching, when quite loading is used."
            ],
            "conditx": [
                "Correlational strength in x-plane [1/m]",
                "Float",
                0.0,
                "CONDITX: is the correlation strength between the amplitude of the eletron's betatron oscillation and its energy. If the condition is applied correctly any emittance effects are removed from the FEL amplification and the focal strength can beincreased. However it requires a conditioning beamline prior to the FEL to apply the correlation. Refer to the paper of Sessler(A.N. Sessler, et al., Phys. Rev. Lett 68 (1992) 309) for more information."
            ],
            "condity": [
                "Correlational strength in x-plane [1/m]",
                "Float",
                0.0,
                "CONDITY: Same as CONDITX but for the correlation in the y-plane."
            ],
            "curpeak": [
                "Peak current of the electron beam [A]",
                "Float",
                250.0,
                "CURPEAK: Peak current of the electron beam. Time-independent simulations enforces a constant current."
            ],
            "cuttail": [
                "Cut in the transverse phase space",
                "Float",
                -1.0,
                "CUTTAIL: Cut in the transverse phase space in measures of the rms size to collimate transverse beam tails/halos. The cut is applied after the loading and beam current is set accordingly to the reduced number of macro particles. It is disabled if the value is negative or the electron beam is imported from an external file."
            ],
            "delgam": [
                "The RMS value of the energy distribution",
                "Float",
                0.005,
                "DELGAM: The RMS value of the energy distribution in terms of electron rest mass energy."
            ],
            "emitx": [
                "RMS emmitance in x [m]",
                "Float",
                2e-06,
                "EMITX: The normalized RMS emittance in x."
            ],
            "emity": [
                "RMS emmitance in y [m]",
                "Float",
                2e-06,
                "EMITY: The normalized RMS emittance in y."
            ],
            "emod": [
                "Initial energy modulation",
                "Float",
                0.0,
                "EMOD: Initial energy modulation, when quite loading is used. The value is the modulation amplitude in terms of gamma."
            ],
            "emodphase": [
                "Phase of initial energy modulation [rad]",
                "Float",
                0.0,
                "EMODPHASE: Phase of initial energy modulation, when quite loading is used."
            ],
            "gamma0": [
                "Mean energy",
                "Float",
                35.2,
                "GAMMA0: The mean energy of the electron beam in terms of the electron rest mass energy."
            ],
            "npart": [
                "Number of macro particles per slice",
                "Integer",
                8192,
                "NPART: The number of macro particles per slice. NPART must be a multiple of 4xNBINS and smaller than  defined in the source file 'genesis.def'."
            ],
            "pxbeam": [
                "Transverse momentum x of the electron beam [m]",
                "Float",
                0.0,
                "PXBEAM: Average normalized transverse momentum x of the electron beam at the undulator entrance. The momenta are defined as PXBEAM = x where x = cvx is the average transverse velocity and the Lorenz factor of the electron energy."
            ],
            "pybeam": [
                "Transverse momentum y of the electron beam [m]",
                "Float",
                0.0,
                "PYBEAM: Average normalized transverse momentum in y of the electron beam at the undulator entrance. See PXBEAM for more information."
            ],
            "rxbeam": [
                "RMS value in x of the transverse [m]",
                "Float",
                0.0001121,
                "RXBEAM: The RMS value in x of the transverse, spatial distribution."
            ],
            "rybeam": [
                "RMS value in y of the transverse [m]",
                "Float",
                0.0001121,
                "RYBEAM: The RMS value in y of the transverse, spatial distribution."
            ],
            "xbeam": [
                "Transverse position in x of the electron beam [m]",
                "Float",
                0.0,
                "XBEAM: Transverse position in x of the electron beam at the undulator entrance with respect to the undulator axis."
            ],
            "ybeam": [
                "Transverse position in y of the electron beam [m]",
                "Float",
                0.0,
                "YBEAM: Transverse position in y of the electron beam at the undulator entrance with respect to the undulator axis."
            ]
        },
        "fieldDistributionAnimation": {
            "notes": ["Notes", "Text", ""],
            "step": ["Step", "Integer", 0]
        },
        "focusing": {
            "dl": [
                "Length of the D-quads",
                "Float",
                0.0,
                "DL: Length of the D-quadrupoles in measures of the undulator period."
            ],
            "drl": [
                "Drift length between F and D quads",
                "Float",
                0.0,
                "DRL: Drift length between F and D quadrupoles in measures of undulator period."
            ],
            "f1st": [
                "Position within a FODO cell",
                "Float",
                0.0,
                "F1ST: Position within a FODO cell, where GENESIS 1.3 starts the FODO cell lattice. To start with a full F-quadrupole set F1ST to zero while a value of FL/2 begins the cell in the middle of the focusing quadrupole."
            ],
            "fl": [
                "Length of the F-quads",
                "Float",
                98.0,
                "FL: Length of the F-quadrupoles in measures of the undulator period. The integration step size DELZ must resolve the quadrupole length."
            ],
            "qfdx": [
                "Quad misplacement in x-direction [m]",
                "Float",
                0.0,
                "QFDX: Maximum transverse misplacement of the quadrupoles in x-direction. A random offset between [-QFDX, QFDX] in x  is applied to every quadrupole. Quadrupole position errors are generated even if the magnetic field is defined by an external file."
            ],
            "qfdy": [
                "Quad misplacement in y-direction [m]",
                "Float",
                0.0,
                "QFDY: Maximum transverse misplacement of the quadrupoles in y-direction, respectively. See QFDX for more information."
            ],
            "quadd": [
                "Field strength of D-quads [T/m]",
                "Float",
                0.0,
                "QUADD: The fields strength of D quadrupoles, defocusing in the x-plane. GENESIS 1.3 automatically applies the correct signs to QUADF and QUADD indicating the alternating focusing in the FODO-lattice."
            ],
            "quadf": [
                "Field strength of F-quads [T/m]",
                "Float",
                1.23,
                "QUADF: The field strength of F quadrupoles, focusing in the x-plane."
            ],
            "sl": [
                "Length of solenoid field",
                "Float",
                0.0,
                "SL: Length of solenoid field in measures of undulator period. The solenoid is aligned to the beginning of each undulator section."
            ],
            "solen": [
                "Solenoid field strength [T]",
                "Float",
                0.0,
                "SOLEN: On-axis field strength of a superimposed solenoid field."
            ]
        },
        "io": {
            "alignradf": [
                "Align radiation field to the electron beam",
                "Boolean",
                0,
                "ALIGNRADF: When the FIELDFILE feature is used than Genesis 1.3 aligns the radiation field to the electron beam so that the radiaiton field is one full slippage behind the electron beam. In this case there is no unphysical calculation because the field which slips through the back into the first electron slice is fully defined. However this alignment depends on the undulator length. To disable the automatic alignment ALIGNRADF has to be set to a non-zero value. If this is the case the last slice of the radiaiton field is aligned with the last electron slice. Field slices, which slips into the first electorn slice and which is not defined by the FIELDFILE is generated by the internal method of using the fundamental Gauss-Hermite mode"
            ],
            "beamfile": [
                "Beam file",
                "String",
                "",
                "BEAMFILE: Specifying a file containing a lookup table for the electron beam parameters at different position along the bunch. "
            ],
            "convharm": [
                "Harmonic number",
                "Integer",
                1,
                "CONVHARM: When the particle distribution is imported from a PARTFILE Genesis 1.3 allows the up-conversion to a higher harmonics. The harmonic number is specified with CONVHARM and has a defulat value of 1, corresponding to no up-conversion.The user has to make sure that in the input deck XLAMDS is adjusted, according to the new wavelength."
            ],
            "distfile": [
                "Distribution file",
                "String",
                "",
                "DISTFILE: If DISTFILE is defined, the 6d distribution is imported into GENESIS 1.3 and used to load the phase space. The quiet start algorithm is bypassed."
            ],
            "ffspec": [
                "FFSPEC",
                "Integer",
                0,
                "To calculate a spectrum a post-processing step requires amplitude and phase, which are writen to the output file, defined by LOUT of column 3 and 4. The values depend on the choice of FFSPEC. If the value is equal the near field on-axis intensity and phase is written, while for a negative value it is the same but in the far field zone. For a positive value the near field intensity is replaced by the total radiation power, assuming transverse coherence."
            ],
            "fieldfile": [
                "Field distribution file",
                "String",
                "",
                "FIELDFILE: Defines the file containing the field distribution. The distribution is directly imported into the arrays, holding the field and the time-records. "
            ],
            "filetype": [
                "File type of all output files",
                "String",
                "ORIGINAL",
                "FILETYPE: Indication of the file type of all output files. "
            ],
            "ibfield": [
                "IBFIELD [T]",
                "Float",
                0.0,
                "IBFIELD: When the PARTFILE features is used the imported particle distribution can be tracked through a generic 4 magnet chicanebefore running the Genesis simulation. The chicane consists out of 4 bending magnets of the field strength IBFIELD and length IMAGL separated by 5 drifts of length IDRIL. If the field strength of the magnet is set to zero the feature of a chicane is disabled (default behavior)"
            ],
            "idmpfld": [
                "Dump field distribution",
                "Boolean",
                0,
                "IDMPFLD: Similar to IDUMP but only for the field distribution. "
            ],
            "idmppar": [
                "Dump particle distribution",
                "Boolean",
                0,
                "IDMPPAR: Similar to IDUMP but only for the particle distribution. "
            ],
            "idril": [
                "Drift Length [m]",
                "Float",
                0.0,
                "IDRIL: The length of the 5 drift lengths of the magnetic chicane (three between the magnets and one before and after the magnets)."
            ],
            "idump": [
                "Dump particle and field distributions",
                "Boolean",
                0,
                "IDUMP: If set to a non-zero value the complete particle and field distribution is dumped at the undulator exit into two outputfiles. The filenames are the filename of the main output file plus the extension '.dpa' and '.dfl', respectively."
            ],
            "ilog": [
                "Write to log",
                "Boolean",
                0,
                "ILOG: If set to a non-zero value all further run-information and error messages are redirect to a log file. The name is the main output file name plus the extension '.log'."
            ],
            "imagl": [
                "Bending magnet length [m]",
                "Float",
                0.0,
                "IMAGL: The length of each bending magnet of the chicane. If the magnet length is set to zero but IDRIL is not the resulting beam line correspond to a simple drift of the length 5 times IDRIL."
            ],
            "iotail": [
                "Output time window eqauls sim time window",
                "Boolean",
                0,
                "IOTAIL: If set to a non-zero value the output time window is the same as the simulated time window. Otherwise the output for the first slices covered by the slippage length is subpressed. Needed for bunches which are completely covered by the time-window."
            ],
            "iphsty": [
                "Generate output at each nth integration step",
                "Integer",
                1,
                "IPHSTY: Generate output in the main output file at each IPHSTYth integration step. To disable output set IPHSTY to zero."
            ],
            "ippart": [
                "Write particle dist at each nth integration step",
                "Integer",
                1,
                "IPPART: Write the particle distribution to file at each IPPARTth integration step. To disable output set IPPART to zero. The filename is the same of the main outputfile + the extension '.par'."
            ],
            "ipradi": [
                "Write field dist at each nth integration step",
                "Integer",
                1,
                "IPRADI: Write the field distribution to file at each IPRADIth integration step. To disable output set IPRADI to zero. The filename is the same of the main outputfile + the extension '.fld'."
            ],
            "ishsty": [
                "Generate output in the main output file for each nth slice.",
                "Integer",
                1,
                "ISHSTY: Generate output in the main output file for each ISHSTYth slice. "
            ],
            "ispart": [
                "Write the particle distribution to file for every nth slice",
                "Integer",
                0,
                "ISPART: Write the particle distribution to file for every ISPART slice. "
            ],
            "isradi": [
                "Write the field distribution to file for every ISRADI slice.",
                "Integer",
                0,
                "ISRADI: Write the field distribution to file for every ISRADI slice."
            ],
            "itram11": [
                "ITRAM11",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram12": [
                "ITRAM12",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram13": [
                "ITRAM13",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram14": [
                "ITRAM14",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram15": [
                "ITRAM15",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram16": [
                "ITRAM16",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram21": [
                "ITRAM21",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram22": [
                "ITRAM22",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram23": [
                "ITRAM23",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram24": [
                "ITRAM24",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram25": [
                "ITRAM25",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram26": [
                "ITRAM26",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram31": [
                "ITRAM31",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram32": [
                "ITRAM32",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram33": [
                "ITRAM33",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram34": [
                "ITRAM34",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram35": [
                "ITRAM35",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram36": [
                "ITRAM36",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram41": [
                "ITRAM41",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram42": [
                "ITRAM42",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram43": [
                "ITRAM43",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram44": [
                "ITRAM44",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram45": [
                "ITRAM45",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram46": [
                "ITRAM46",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram51": [
                "ITRAM51",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram52": [
                "ITRAM52",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram53": [
                "ITRAM53",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram54": [
                "ITRAM54",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram55": [
                "ITRAM55",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram56": [
                "ITRAM56",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram61": [
                "ITRAM61",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram62": [
                "ITRAM62",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram63": [
                "ITRAM63",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram64": [
                "ITRAM64",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram65": [
                "ITRAM65",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "itram66": [
                "ITRAM66",
                "Float",
                0.0,
                "Define the matrix element for the transport matrix, which is applied when importing a paticle distribution with the PARTFILE option. The matrix is defined in a standard way, acting on the vector (position in X, angle in X, position in Y, angle in Y, position in s, relative energy spread). The default value is the identity matrix."
            ],
            "lout": [
                "Defines, which parameter is included in the main output file.",
                "Integer19StringArray",
                "1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0",
                "Defines, which parameter is included in the main output file.",
                "Radiation Power, Logarithmic derivative of the power growth, Power density at the undulator axis, Radiation phase at the undulator axis, Transverse radiation size, Rms diffraction angle of the radiation, Beam energy, Bunching factor, Beam size in x, Beam size in y, Error in energy conservation, Beam position in x, Beam position in y, Energy spread, On-axis field intensity in the far field zone, Output of 2nd harmonic, Output of 3rd harmonic, Output of 4th harmonic, Output of 5th harmonic"
            ],
            "magin": [
                "Use maginfile",
                "Boolean",
                0,
                "MAGIN: If set to a non-zero value the user is prompted to type in the file name containing a explicit description of the magnetic field."
            ],
            "maginfile": [
                "Magnetic field file",
                "String",
                "",
                "MAGINFILE Defines a file, which contains the magnetic field description, bypassing the interactive request of MAGIN."
            ],
            "magout": [
                "Use magout file",
                "Boolean",
                0,
                "MAGIN: Similar to MAGIN to write out the magnetic field lattice used for the simulation."
            ],
            "magoutfile": [
                "Magnetic field output file",
                "String",
                "",
                "Defines the file to which the magnetic field lattice is written to, bypassing the interactive request of MAGOUT."
            ],
            "multconv": [
                "MULTCONV",
                "Integer",
                0,
                "If an imported particle distribution from a PARTFILE is up-converted to a higher harmonics the dault behavior is that the number of slices is preserved. This requires that ZSEP is adjusted together with XLAMDS. However if frequency resolution is a problem then a particle distribution can be converted and used multiple times to keep ZSEP constant.The disadvantage is that the CPU execution time is increased as well."
            ],
            "ndcut": [
                "NDCUT where time-window = (tmax-tmin)/NDCUT",
                "Integer",
                0,
                "NDCUT: When loading a slice, only particles of the external distribution are used, which falls within a small time-window centered around the current position of the slice. If NDCUT has a value larger than zero the width is calculated by (tmax-tmin)/NDCUT, where tmax and tmin are determined, while scanning through the particle distribution. If NDCUT is zero, the time-window is adjusted, so that in average NPART/NBINS particles fall in each slice."
            ],
            "offsetradf": [
                "Skip slices for relative position",
                "Integer",
                0,
                "OFFSETRADF: If the automatic alignment of the radiation field is disabled by setting ALIGNRADF to a non-zero value, the default alignment is that the first slice of the radiaiton field overlaps with the first slice of the electron beam. However the relative position can be controlled by OFFSETRADF. The value of OFFSETRADF defines the number of slice to skip before filling it for the first electorn slice. E.g. a value of 4 will uses the 5th slice for the simulation of the first slice. slices one to 4 will be used to fill up the slippage field. If Genesis 1.3. require to fill a slice which is not defined by the FIELDFILE then it uses the internal method of a fundamental Gauss-Hermite mode."
            ],
            "outputfile": [
                "Name of main output file",
                "String",
                "genesis.out",
                "OUTPUTFILE: The name of the main output file. The prompt for the output filename at the beginning of a GENESIS 1.3 run will be suppressed."
            ],
            "partfile": [
                "Particle distribution file",
                "String",
                "",
                "PARTFILE: Defines the file containing the particle distribution. The distribution is directly imported into the arrays holding the particle variables. "
            ],
            "radfile": [
                "Lookup table for seeding radiation pulse",
                "String",
                "",
                "RADFILE: Specifying a file containing a lookup table for the seeding radiation pulse at different position along the bunch. "
            ],
            "trama": [
                "Enable transport matrix",
                "Boolean",
                0,
                "TRAMA: Non zero value enables that a transport matrix is applied to the electron distribution when importing it with PARTFILE. The individual matrix is defined by ITRAM##"
            ]
        },
        "parameterAnimation": {
            "notes": ["Notes", "Text", ""],
            "y": ["Y Value", "OutputParameter", "power"]
        },
        "particleAnimation": {
            "histogramBins": ["Histogram Bins", "Integer", 200],
            "notes": ["Notes", "Text", ""],
            "x": ["X Value", "ParticleColumn", "psi"],
            "y": ["Y Value", "ParticleColumn", "gamma"]
        },
        "particleLoading": {
            "iall": [
                "All slices start with the same element",
                "Boolean",
                0,
                "IALL: A non-zero value of IALL enforces that all slices are starting with the same element of the Hammersley sequences. It is recommend for time-dependent simulation excluding shot noise. IALL is set automatically for scans."
            ],
            "igamgaus": [
                "Distribution profile",
                "IgamGaus",
                1,
                "Defines distribution profile in energy. A non-zero value generates a Gaussian distribution and a uniform otherwise."
            ],
            "ildgam": [
                "Hammersley base for loading the energy distribution",
                "Integer",
                5,
                "ILDGAM: Hammersley base for loading the energy distribution. See ILDPSI for more information.Note that the loading of the energy distribution is Gaussian and uses two bases (ILDGAM and ILDGAM + 1)."
            ],
            "ildpsi": [
                "Indices of the Hammersley",
                "Integer",
                7,
                "ILDPSI: Indices of the Hammersley sequence bases for loading the particle phase. GENESIS 1.3 uses the first 26 prime numbers as bases. To avoid correlation between the variables each base should be different. "
            ],
            "ildpx": [
                "Hammersley base for loading the distribution in px",
                "Integer",
                3,
                "ILDPX: Hammersley base for loading the distribution in px. See ILDPSI for more information."
            ],
            "ildpy": [
                "Hammersley base for loading the distribution in py",
                "Integer",
                4,
                "ILDPY: Hammersley base for loading the distribution in py. See ILDPSI for more information."
            ],
            "ildx": [
                "Hammersley base for loading the distribution in x",
                "Integer",
                1,
                "ILDX: Hammersley base for loading the distribution in x. See ILDPSI for more information."
            ],
            "ildy": [
                "Hammersley base for loading the distribution in y",
                "Integer",
                2,
                "IDLY: Hammersley base for loading the distribution in y. See ILDPSI for more information."
            ],
            "inverfc": [
                "Use inverted error function",
                "Boolean",
                1,
                "INVERFC: When set to a non-zero value, the inverted error function is used for generating a Gaussian distribution instead of the joint-propability method. It results in smoother distribution in energy and transverse dimensions."
            ],
            "ipseed": [
                "Random seed for particle phase fluctuation",
                "Integer",
                -1,
                "IPSEED: Initial seed for the random number generator used for particle phase fluctuation (shot noise). GENESIS 1.3 requires a re-initialization of the random number generator to guarantee the same loading whether magnetic field errors are used or not."
            ],
            "itgaus": [
                "Distribution profile in the transverse variables",
                "ItGaus",
                1,
                "ITGAUS: Defines distribution profile in the transverse variables. The available distributions are:- Gaussian (ITGAUS=1)- Uniform (ITGAUS=2)- Parabolic (otherwise)"
            ],
            "nbins": [
                "Number of bins in the particle phase",
                "Integer",
                4,
                "NBINS: Number of bins in the particle phase. The value has to be at least 4 or larger than (2+2n), depending on whether the bunching at the nth harmonics is needed for space charge calculations or output."
            ]
        },
        "mesh": {
            "dgrid": [
                "Grid size [m]",
                "Float",
                0.0,
                "DGRID: Any value larger than zero explicitly sets the grid size, overruling the calculation by the RMAX0-parameter."
            ],
            "iscrkup": [
                "Update all Runge-Kutta integration steps",
                "Boolean",
                0,
                "ISCRKUP: If set to a non-zero value then the space charge field is updated at each of the 4 Runge-Kutta integration steps instead of the default behavior, where the space charge field is claculated only once before the Runge-Kutta integration. It increases the stability and precision of the space charge field but it comes with a cost in slower execution speed."
            ],
            "lbc": [
                "Boundary Condition",
                "Lbc",
                0,
                "LBC: Flag to set the boundary condition for the field solver. The options are Direchlet boundary condition (LBC = 0) and Neumann boundary condition (otherwise). Anyhow the grid should be chosen large enough so that the choice of LBC should not change the results."
            ],
            "ncar": [
                "N grid points for radiation field",
                "Integer",
                151,
                "NCAR: The number of grid points for the radiation field along a single axis. The total number for the mesh is NCAR2. NCAR must be an odd number to cover the undulator axis with one grid point. Do not exceed NCMAX defined in the source file 'genesis.def'."
            ],
            "nptr": [
                "Number of radial grid points",
                "Integer",
                40,
                "NPTR: Number of radial grid points, on which the space charge field is evaluated. The radial axis is automatically chosen by GENESIS 1.3 to be twice as long as the maximum offset of macro particles relative to the center of the electron beam. This excludes effects of the boundary condition even for the case of narrow beams."
            ],
            "nscr": [
                "Number of azimuthal modes",
                "Integer",
                1,
                "NSCR: Number of azimuthal modes for space charge calculation."
            ],
            "nscz": [
                "Number of longitudinal Fourier components",
                "Integer",
                1,
                "NSCZ: Number of longitudinal Fourier components for space charge calculation. NSCZ must be greater than 0 to include space charge but less than (2NBINS+2) for valid results."
            ],
            "rmax0": [
                "Radiation field scaling factor",
                "Float",
                9.0,
                "RMAX0: GENESIS 1.3 estimates the size of the grid on which the radiation field is discretized by scaling the averages size of the initial radiation field and beam size with RMAX0. The explicit size is [-DGRID,DGRID] in both dimensions with DGRID = RMAX0(r,beam+r,field).The electron beam size is the rms sum of RXBEAM and RYBEAM while the radiation field  size is calculated with ZRAYL and ZWAIST."
            ],
            "rmax0sc": [
                "Radial grid size",
                "Float",
                0.0,
                "RMAX0SC: Explicitly defines the radial grid size for space charge calculations when set to a positive value. Otherwise, Genesis calculates the grid size from the current size of the electron beam."
            ]
        },
        "radiation": {
            "iallharm": [
                "IALLHARM",
                "Integer",
                0,
                "IALLHARM: As a default setting only the fundamental and the harmonic, defined by NHARMare calculated. Setting the value to a non-zero value will also include all harmonics between. This option will be set automaticaly when the harmonics are calculated self-consistently."
            ],
            "iharmsc": [
                "IHARMSC",
                "Integer",
                0,
                "IHARMSC: Typically the harmonics are driven by the non-linear dynamics on the fundamental and the feed back of the harmonics on theelectron beam can be neglected for the sake of faster calculation. However setting IHARMSC to a non-zero value includes the coupling of the harmonic radiation back to the electron beam for a self-consistent model of harmonics. Enabling this feature will automatically includeall harmonics by setting IALLHARM to one."
            ],
            "nharm": [
                "Calculation of harmonics up to n",
                "Integer",
                1,
                "NHARM: Enables the calculation of harmonics up to the one, specified by NHARM. Note that the number of NBINS has to be at least twice as large as NHARM to allow for the correct representation of the harmonics. Note also that this parameterdoes not enable automatically the output. For that the corresponding bit in LOUT has to be set as well."
            ],
            "prad0": [
                "Input power of the radiation field [W]",
                "Float",
                10.0,
                "PRAD0: The input power of the radiation field. For SASE simulation PRAD0 should be set to zero value or at least well below the shot noise level."
            ],
            "pradh0": [
                "PRADH0",
                "Float",
                0.0,
                "Radiation power for seeding with a harmonics, defined by NHARM.The waist position and waist size is identical to the fundamental (ZWAIST) thus using a scaled value of NHARM*ZRAYL for the Rayleigh length."
            ],
            "xlamds": [
                "Resonant radiation wavelength [m]",
                "Float",
                1.2852e-05,
                "XLAMDS: The resonant radiation wavelength. Due to the bandwidth of time-dependent simulation SASE simulations do not require a very precise value for XLAMDS."
            ],
            "zrayl": [
                "Rayleigh length of seeding radiation [m]",
                "Float",
                0.5,
                "ZRAYL: The Rayleigh length of the seeding radiation field. ZRAYL is defined as pi*w0^2/XLAMDS where w0 is the radius of the optical beam waist. The Rayleigh length is a measure for the diffraction w(z)^2 = w0^2(1 + (z - ZWAIST)^2/ZRAYL^2) and is needed to calculate the size and divergence/convergence of the seeding field at the undulator entrance. Because the field size can determine the grid size it is strongly recommended to supply reasonable numbers for ZRAYL and ZWAIST even for simulation starting from noise."
            ],
            "zwaist": [
                "Waist position [m]",
                "Float",
                0.0,
                "ZWAIST: Position of the waist of the seeding radiation field with respect to the undulator entrance. ZWAIST is needed in combination with ZRAYL to calculate the initial radiation field. Note that a waist position within the undulator (ZWAIST  >  0) is only used to determine the initial convergence. The FEL interaction might significantly change the beam size and diffraction of the radiation field (gain guiding)."
            ]
        },
        "scan": {
            "iscan": [
                "Parameter for scan",
                "Iscan",
                0,
                "ISCAN: Selects the parameter for a scan over a certain range of its value. The last two enables a user-defined scan, where a steady-state run is performed for each entryof the supplied BEAMFILE. BEAMOPT differs from BEAMFILE that it automatically adjust XLAMDS according to the resonance condition and the beam energy, defined in the BEAMFILE.The BEAMGAM option is similar to BEAMFILE, but overwrites the value of energy with GAMMA0 from the main input file."
            ],
            "nscan": [
                "Steps per scan",
                "Integer",
                3,
                "NSCAN: Number of steps per scan."
            ],
            "svar": [
                "Scan range",
                "Float",
                0.01,
                "SVAR: Defines the scan range of the selected scan parameter. The parameter is varied between (1-SVAR) and (1+SVAR) of its initial value. One exception is the scan over ISEED where the random number generator is not reinitialized."
            ]
        },
        "simulationControl": {
            "delz": [
                "Integration step size",
                "Float",
                1.0,
                "DELZ: Integration step size in measure of the undulator period length."
            ],
            "eloss": [
                "Externally applied energy loss of the electron beam [eV/m]",
                "Float",
                0.0,
                "ELOSS: Externally applied energy loss of the electron beam."
            ],
            "iorb": [
                "Use orbit correction",
                "Boolean",
                0,
                "IORB: Flag for orbit correction. For any non-zero value the offset due to the wiggle motion is taken into account for the interaction between electron beam and radiation field. The correction is not included in the output values for the beam centroid position."
            ],
            "isravg": [
                "Include energy loss due to spontaneous synchrotron radiation",
                "Boolean",
                0,
                "ISRAVG: If set to a non-zero value the energy loss due to spontaneous synchrotron radiation is included in the calculation."
            ],
            "isrsig": [
                "Use quantum fluctuation",
                "Boolean",
                0,
                "If set to a non-zero value the increase of the energy spread due to the quantum fluctuation of the spontaneous synchrotron radiation is included in the calculation."
            ],
            "version": [
                "VERSION",
                "Float",
                0.1,
                "Used for backward compatibility of the input decks. Some parameters might change their behavior for older versions of GENESIS 1.3. The current version is 1.0."
            ],
            "zstop": [
                "Total integration length [m]",
                "Float",
                0.0,
                "ZSTOP: Defines the total integration length. If the undulator length is shorter than ZSTOP or ZSTOP is zero or negative, the parameter is ignored and the integration is performed over the entire undulator."
            ]
        },
        "simulationStatus": {},
        "timeDependence": {
            "curlen": [
                "Bunch length of the current profile [m]",
                "Float",
                0.001,
                "CURLEN: Bunch length of the current profile. If CURLEN is positive a Gaussian distribution is generated with an rms length given by CURLEN. A negative or zero value yield a constant profile."
            ],
            "isntyp": [
                "ISNTYP",
                "Integer",
                0,
                "For VERSION below 1.0 only the Pennman algorighm is used for the shot noise, which is only correct for the fundamental wavelength, but for a higher version the default is the Fawley algorithm which applies also the correct shotnoise to allhigher harmonics. If the user wants to use the Pennman algorith at a higher version number (which is not recommended), the value of ISNTYP has to be set to a non-zero value."
            ],
            "itdp": [
                "Enables time-dependent simulation",
                "Boolean",
                0,
                "ITDP: A non-zero value enables time-dependent simulation. Time-dependence is not allowed if the scan-feature is enabled. "
            ],
            "nslice": [
                "Number of simulated slices",
                "Float",
                408.0,
                "NSLICE: Total number of simulated slices. It defines the time window of the simulation with NSLICE * ZSEP * XLAMDS/c. Note that the output does not start with the first slice unless the parameter IOTAIL is set. If NSLICE set to zero it automatically adjust NSLICE and NTAIL to the time-window given by the external input files (BEAMFILE or DISTFILE). It assumes 6 standard deviation for a Gaussian distribution or the absolute value of CURLEN for a step profile."
            ],
            "ntail": [
                "Position of the first simulated slice",
                "Integer",
                -253,
                "NTAIL: Position of the first simulated slice in measures of ZSEP*XLAMDS. GENESIS 1.3 starts with the tail side of the time window, progressing towards the head.  Thus a negative or positive value shifts the slices towards the tail or head region of the beam, respectively. For a constant profile (CURLEN  <  0) NTAIL has no impact."
            ],
            "shotnoise": [
                "Random offset to each macro particle phase",
                "Float",
                1.0,
                "GENESIS 1.3 applies a random offset to each macro particle phase to generate the correct statistic for the bunching factor. Each offset is scaled prior by SHOTNOISE, thus SHOTNOISE can be set to zero to disable shot noise. "
            ],
            "zsep": [
                "Separation of beam slices",
                "Float",
                1.0,
                "ZSEP: Separation of beam slices in measures of the radiation wavelength. ZSEP must be a multiple of DELZ."
            ]
        },
        "undulator": {
            "aw0": [
                "Dimensionless RMS undulator parameter",
                "Float",
                0.735,
                "AW0: The normalized, dimensionless rms undulator parameter, defined by AW0 = (e/mc)(Bu/ku), where e is the electron charge, m is electron mass, c is speed of light, ku=2pi/lambdau is the undulator wave number, lambdau is the undulator period. Bu is the rms undulator field with Bu = Bp/2 for a planar undulator and Bu = Bp/2 for a helical undulator, where Bp is the on-axis peak field."
            ],
            "awd": [
                "Virtual undulator parameter",
                "Float",
                0.735,
                "AWD: A virtual undulator parameter for the gap between undulator modules. The only purpose of this parameter is to delay the longitudinal motion of the electrons in the same manner as AW0 does within the undulator modules. It is used to keep the electron and radiation phases synchronize up to the point when the interaction at the next undulator module starts again. AWD has typically the same value as AW0, but might vary for optimum matching between the modules. "
            ],
            "awx": [
                "Maximum offset in x",
                "Float",
                0.0,
                "AWX: Maximum offset in x for undulator module misalignment. The error for each individual module followsa uniform distribution"
            ],
            "awy": [
                "Maximum offset in y",
                "Float",
                0.0,
                "AWY: Maximum offset in y for undulator module misalignment. The error for each individual module followsa uniform distribution"
            ],
            "delaw": [
                "Error distribution",
                "Float",
                0.0,
                "DELAW: RMS value of the undulator field error distribution. A value of zero disables field errors."
            ],
            "fbess0": [
                "Coupling factor",
                "Float",
                0.0,
                "FBESS0: The coupling factor of the electron beam to the radiation field due to the longitudinal wiggle motion of the electrons.  It is 1.0 for a helical undulator and J0(x) - J1(x) for a planarundulator where J0(x), J1(x) are Bessel functions and x = AW0^2/2(1+AW0^2). If FBESS0 is set to 0.0 GENESIS 1.3 calculates the value."
            ],
            "iertyp": [
                "Type of undulator field errors",
                "Iertyp",
                0,
                "IERTYP: Type of undulator field errors. Either a uniform (+/-1) or Gaussian (+/- 2) distribution can be chosen. If IERTYP is negative the errors are correlated to minimize the first and second field integral. IERTYP =0 disables field errors. Field errors requires a integration step size of half an undulator period (DELZ = 0.5). Note that field errors are applied even if the magnetic lattice is defined by an external file."
            ],
            "iseed": [
                "Inital random number generation seed",
                "Integer",
                -1,
                "ISEED: The initial seeding of the random number generator for field errors."
            ],
            "iwityp": [
                "Undulator type",
                "Iwityp",
                0,
                "IWITYP: Flag indicating the undulator type. Planar undulator or helical."
            ],
            "nsec": [
                "Number of undulator sections",
                "Integer",
                1,
                "NSEC: The number of sections of the undulator. Note that a section length in not automatically identical with the undulator module length. GENESIS 1.3 aligns modules to the FODO-lattice. If a module ends within a FODO cell the next module starts with the beginning of the next cell. Sometimes this results in a longitudinal gap between adjacent undulator modules."
            ],
            "nwig": [
                "Periods per undulator module",
                "Integer",
                98,
                "NWIG: The number of periods within a single undulator module. The product of NWIG and XLAMD defines the length of the undulator module."
            ],
            "wcoefz1": [
                "Start of undulator tapering [m]",
                "Float",
                0.0,
                "WCOEFZ(1): Start of undulator tapering. Note that tapering is applied, even the magnetic lattice is defined by an external file."
            ],
            "wcoefz2": [
                "Relative change over taper",
                "Float",
                0.0,
                "WCOEFZ(2): The relative change of the undulator field over the entire taper length (AW(exit) = (1 - WCOEFZ(2)) AW(entrance)). In the case of a multi section undulator GENESIS 1.3 tapers the magnetic field over the gaps as well, resulting in a jump of the magnetic field AW(z) between two modules."
            ],
            "wcoefz3": [
                "Taper model",
                "TaperModel",
                "0",
                "WCOEFZ(3): The taper model:= 1 for linear taper,= 2 for quadratic taper, or no taper otherwise."
            ],
            "xkx": [
                "Undulator focus param",
                "Float",
                0.0,
                "XKX: Normalized natural focusing of the undulator in x. Common values are XKX = 0.0, XKY = 1.0 for a planar undulator or XKX, XKY = 0.5 for a helical undulator, but might vary if focusing by curved pole faces is simulated. The values should fulfill the constraint XKX + XKY = 1.0. "
            ],
            "xky": [
                "Undulator focus param",
                "Float",
                1.0,
                "XKY: Normalized natural focusing of the undulator in x. See XKX for more information."
            ],
            "xlamd": [
                "Undulator period length [m]",
                "Float",
                0.0205,
                "XLAMD: The undulator period length."
            ]
        }
    },
    "strings": {
        "completionState": ": {frameCount} steps"
    },
    "view": {
        "electronBeam": {
            "title": "Electron Beam",
            "advanced": [],
            "basic": [
                "alphax",
                "alphay",
                "bunch",
                "bunchphase",
                "conditx",
                "condity",
                "curpeak",
                "cuttail",
                "delgam",
                "emitx",
                "emity",
                "emod",
                "emodphase",
                "gamma0",
                "npart",
                "pxbeam",
                "pybeam",
                "rxbeam",
                "rybeam",
                "xbeam",
                "ybeam"
            ]
        },
        "fieldDistributionAnimation": {
            "title": "Field Distribution",
            "advanced": []
        },
        "focusing": {
            "title": "Focusing",
            "advanced": [],
            "basic": [
                "dl",
                "drl",
                "f1st",
                "fl",
                "qfdx",
                "qfdy",
                "quadd",
                "quadf",
                "sl",
                "solen"
            ]
        },
        "io": {
            "title": "I/O",
            "advanced": [],
            "basic": [
                "alignradf",
                "convharm",
                "ffspec",
                "ibfield",
                "idmpfld",
                "idril",
                "idump",
                "imagl",
                "iotail",
                "isradi",
                "itram11",
                "itram12",
                "itram13",
                "itram14",
                "itram15",
                "itram16",
                "itram21",
                "itram22",
                "itram23",
                "itram24",
                "itram25",
                "itram26",
                "itram31",
                "itram32",
                "itram33",
                "itram34",
                "itram35",
                "itram36",
                "itram41",
                "itram42",
                "itram43",
                "itram44",
                "itram45",
                "itram46",
                "itram51",
                "itram52",
                "itram53",
                "itram54",
                "itram55",
                "itram56",
                "itram61",
                "itram62",
                "itram63",
                "itram64",
                "itram65",
                "itram66",
                "magin",
                "magout",
                "multconv",
                "ndcut",
                "offsetradf",
                "trama"
            ]
        },
        "mesh": {
            "title": "Mesh",
            "advanced": [],
            "basic": [
                "dgrid",
                "iscrkup",
                "lbc",
                "ncar",
                "nptr",
                "nscr",
                "nscz",
                "rmax0",
                "rmax0sc"
            ]
        },
        "parameterAnimation": {
            "title": "Parameter Report",
            "advanced": [
                "y"
            ]
        },
        "particleAnimation": {
            "title": "Particle Distribution",
            "advanced": [
                "histogramBins",
                "x",
                "y"
            ]
        },
        "particleLoading": {
            "title": "Particle Loading",
            "advanced": [],
            "basic": [
                "iall",
                "igamgaus",
                "ildgam",
                "ildpsi",
                "ildpx",
                "ildpy",
                "ildx",
                "ildy",
                "inverfc",
                "ipseed",
                "itgaus",
                "nbins"
            ]
        },
        "radiation": {
            "title": "Radiation",
            "advanced": [],
            "basic": [
                "iallharm",
                "iharmsc",
                "nharm",
                "prad0",
                "pradh0",
                "xlamds",
                "zrayl",
                "zwaist"
            ]
        },
        "scan": {
            "title": "Scan",
            "advanced": [],
            "basic": [
                "iscan",
                "nscan",
                "svar"
            ]
        },
        "simulationControl": {
            "title": "Simulation Control",
            "advanced": [],
            "basic": [
                "delz",
                "eloss",
                "iorb",
                "isravg",
                "isrsig",
                "version",
                "zstop"
            ]
        },
        "simulationStatus": {
            "title": "Simulation Status",
            "advanced": [],
            "basic": []
        },
        "timeDependence": {
            "title": "Time Dependence",
            "advanced": [],
            "basic": [
                "curlen",
                "isntyp",
                "nslice",
                "ntail",
                "shotnoise",
                "zsep"
            ]
        },
        "undulator": {
            "title": "Undulator",
            "advanced": [],
            "basic": [
                "aw0",
                "awd",
                "awx",
                "awy",
                "delaw",
                "fbess0",
                "iertyp",
                "iseed",
                "iwityp",
                "nsec",
                "nwig",
                "wcoefz1",
                "wcoefz2",
                "wcoefz3",
                "xkx",
                "xky",
                "xlamd"
            ]
        }
    }
}
